/*Визначте інтерфейс, який використовує сигнатуру індексу з типами об'єднання. Наприклад,
тип значення для кожного ключа може бути число | рядок.

Створіть інтерфейс, у якому типи значень у сигнатурі індексу є функціями.
Ключами можуть бути рядки, а значеннями — функції, які приймають будь-які аргументи.

Опишіть інтерфейс, який використовує сигнатуру індексу для опису об'єкта, подібного до масиву.
Ключі повинні бути числами, а значення - певного типу.

Створіть інтерфейс з певними властивостями та індексною сигнатурою.
Наприклад, ви можете мати властивості типу name: string та індексну сигнатуру для додаткових динамічних властивостей.

Створіть два інтерфейси, один з індексною сигнатурою, а інший розширює перший, додаючи специфічні властивості.

Напишіть функцію, яка отримує об'єкт з індексною сигнатурою і перевіряє,
чи відповідають значення певних ключів певним критеріям (наприклад, чи всі значення є числами).*/

/*
Индексная сигнатура с объединением типов Определите интерфейс, который использует индексную сигнатуру с типами объединения (union types).
Например, значение для каждого ключа может быть типом number | string.

Индексная сигнатура для функций Создайте интерфейс, в котором типами значений в индексной сигнатуре являются функции.
Ключами должны быть строки, а значениями — функции, которые принимают любые аргументы.

Массивоподобный объект Опишите интерфейс, который использует индексную сигнатуру для описания объекта, похожего на массив.
Ключи должны быть числами, а значения — определенного типа.

Смешанный интерфейс (фиксированные + динамические свойства) Создайте интерфейс с определенными обязательными свойствами
и индексной сигнатурой. Например, свойство name: string и индексная сигнатура для дополнительных динамических свойств.

Наследование интерфейсов с сигнатурой Создайте два интерфейса: первый с индексной сигнатурой,
а второй — расширяющий первый и добавляющий специфические (конкретные) свойства.

Функция валидации объекта Напишите функцию, которая принимает объект с индексной сигнатурой и проверяет,
соответствуют ли значения определенных ключей заданным критериям (например, являются ли все значения числами).
*/

interface objectX {
    [key: string]: string | number;
}

const objectXNew: objectX = {
    name: 'Mike',
    age: 18,
    place: 'London'
};

//=====================================================================

interface objectY {
    [key: string]: (...args: any[]) => void,
}

const objectYNew: objectY = {
    log: (msg) => console.log(msg)
};

//=====================================================================

interface objectZ {
    [index: number]: string;
}

const objectZNew: objectZ = {
    1: 'Mike',
    2: '15',
    3: 'true'
};

//=====================================================================

interface objectW {
    name: string;
    surname?: string;

    [key: string]: string | number | undefined;
}

const objectWNew: objectW = {
    name: 'Mike',
    age: 18,
    department: 'London'
};

//=====================================================================

interface objectG {
    [key: string]: string | number;
}

interface objectD extends objectG {
    name: string;
    surname: string;
}

const objectDNew: objectD = {
    name: 'Mike',
    surname: 'XXXX',
    department: 3
};

//=====================================================================

interface objectL {
    [key: string]: number | string;
}

const objectLNew: objectL = {
    name: 12,
    age: ' ',
    place: 6
};

function areAllValuesNumbers(obj: object): boolean {
    for (const key in obj) {
        if (typeof obj[key] !== 'number') {
            return false;
        }
    }
    return true;
}

console.log(areAllValuesNumbers(objectLNew))